app/views/teams/_form.html.erb

  <p>Team Name: <%= form.text_field :name %></p>
  <p>Course ID: <%= form.select :course_id , Course.pluck(:id) %></p>
---
SELECT "courses"."id" FROM "courses"