app/views/teams/_team.html.erb

SELECT "students".* FROM "students" INNER JOIN "students_teams" ON "students"."id" = "students_teams"."student_id" WHERE "students_teams"."team_id" = ?  [["team_id", 1]]
---
<p>Updated at: <%= team.updated_at %><p>
<p>Members: <%=  team.students.length > 0 ? team.students.map {|student| student.namedotnumber}.join(", ") : "No Members"%>