app/views/teams/new_member.html.erb


  <p>Student: <%= form.select "student_id", Student.pluck(:namedotnumber) %></p>
---
SELECT "students"."namedotnumber" FROM "students"