app/views/partials/_navbar.html.erb

SELECT "admins".* FROM "admins" WHERE "admins"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "admin.1@osu.edu"], ["LIMIT", 1]]
---
            <li class = "nav-item">
              <%= link_to 'Profile', "/admins/#{(Admin.find_by namedotnumber: current_user.namedotnumber).id}" , class: 'nav-link'%>

SELECT "students".* FROM "students" WHERE "students"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "imbrock.7"], ["LIMIT", 1]]
---
            <li class = "nav-item">
              <%= link_to 'Profile', "/students/#{(Student.find_by namedotnumber: current_user.namedotnumber).id}" , class: 'nav-link'%>