app/views/home/index.html.erb

				<% if current_user.admin? %>
					<p>Your admin id: <%= (Admin.find_by namedotnumber: current_user.namedotnumber).id %> </p>
				<% else %>
					<p>Your student id: <%= (Student.find_by namedotnumber: current_user.namedotnumber).id %> </p>
---
SELECT "admins".* FROM "admins" WHERE "admins"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "admin.1"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "imbrock.7"], ["LIMIT", 1]]