app/views/courses/_course.html.erb

SELECT "teams".* FROM "teams" WHERE "teams"."course_id" = ?  [["course_id", 1]]
---
<p> Team(s) that are part of the course and their respective members: </p>
<% teams = (Team.where(course_id: course.id).map {|e| e.name}) %>
<% students = Team.where(course_id: course.id).map {|team| (team.students.length > 0 ? team.students.map {|student| student.namedotnumber}.join(", ") : "No Members")}%>