app/views/project_evaluations/_form.html.erb

<p>
  Teams: <%= form.select :teamid , Student.find_by(namedotnumber: current_user.namedotnumber).teams.map {|team| team.id} %><br>
---
SELECT "students".* FROM "students" WHERE "students"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "dead.1"], ["LIMIT", 1]]