app/controllers/admins_controller.rb

  def index
    @admins = Admin.all
---
SELECT "admins".* FROM "admins"

  def create
    params.permit!
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save
---
INSERT INTO "admins" ("namedotnumber", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["namedotnumber", "test.1"], ["first_name", "test"], ["last_name", "ing"], ["created_at", "2022-12-04 22:16:21.533396"], ["updated_at", "2022-12-04 22:16:21.533396"]]

  def destroy
    (User.find_by namedotnumber: @admin.namedotnumber).destroy
    @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 36]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT "users".* FROM "users" WHERE "users"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "admin.1"], ["LIMIT", 1]]

    def set_admin
      @admin = Admin.find(params[:id])
---
SELECT "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 36], ["LIMIT", 1]]