app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("subject", "number", "semester", "created_at", "updated_at", "admin_id") VALUES (?, ?, ?, ?, ?, ?)  [["subject", "CSE"], ["number", "3901"], ["semester", "AUTUMN"], ["created_at", "2022-12-05 01:42:33.273513"], ["updated_at", "2022-12-05 01:42:33.273513"], ["admin_id", 0]]
---
  def create
    params.permit!
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 1]]
---
  def destroy

    #Delete teams that are part of the course
    Team.where(course_id: @course.id).each {|team| team.destroy}

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])