app/controllers/evaluations_controller.rb

  def index
    @evaluations = Evaluation.all
    @project_evaluations = ProjectEvaluation.all
    @tech_task_evaluations = TechTaskEvaluation.all
---
SELECT "evaluations".* FROM "evaluations"
SELECT "project_evaluations".* FROM "project_evaluations"
SELECT "tech_task_evaluations".* FROM "tech_task_evaluations"