app/controllers/project_evaluations_controller.rb

  def index
    @project_evaluations = ProjectEvaluation.all
---
SELECT "project_evaluations".* FROM "project_evaluations"

  def create
    #Allowing all params for :teamid to work properly
    params.permit!
    @project_evaluation = ProjectEvaluation.new(project_evaluation_params)

    respond_to do |format|
      if @project_evaluation.save
---
INSERT INTO "project_evaluations" ("overall", "implementation", "documentation", "testing", "meeting", "best_qualities", "improve_on", "professor", "other", "created_at", "updated_at", "teamid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @project_evaluation.destroy
---
DELETE FROM "project_evaluations" WHERE "project_evaluations"."id" = ?  [["id", 8]]

    def set_project_evaluation
      @project_evaluation = ProjectEvaluation.find(params[:id])
---
SELECT "project_evaluations".* FROM "project_evaluations" WHERE "project_evaluations"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]