app/controllers/students_controller.rb

SELECT "students".* FROM "students"
---
  def index
    @students = Student.all

INSERT INTO "students" ("namedotnumber", "first_name", "last_name", "created_at", "updated_at", "team_id") VALUES (?, ?, ?, ?, ?, ?)  [["namedotnumber", "lastname.1"], ["first_name", "test"], ["last_name", "lastname"], ["created_at", "2022-12-02 22:10:22.442114"], ["updated_at", "2022-12-02 22:10:22.442114"], ["team_id", nil]]
---
  def create
    params.permit!
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save

DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "imbrock.7"], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]
---
  def destroy
    (User.find_by namedotnumber: @student.namedotnumber).destroy
    @student.destroy

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_student
      @student = Student.find(params[:id])