app/controllers/teams_controller.rb

  def new_member
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def submit_member
    params.permit!
    @team = Team.find(params["id"]) #get the matching team
    @student = Student.find_by(namedotnumber: params["changes"]["student_id"]) #get the matching student in the drop down
    if ActiveModel::Type::Boolean.new.cast(params["changes"]["add"])
      @student.teams << @team unless @student.teams.include? @team #update the students_teams join table (add student)
      @removed = false
    else
      @student.teams.delete(@team) if @student.teams.include? @team #update the students_teams join table (remove student)
      @removed = true
    end
    respond_to do |format|
      if @student.teams.include? @team
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."namedotnumber" = ? LIMIT ?  [["namedotnumber", "student.2"], ["LIMIT", 1]]
INSERT INTO "teams" ("created_at", "updated_at", "course_id", "name") VALUES (?, ?, ?, ?)  [["created_at", "2022-12-03 01:28:39.234577"], ["updated_at", "2022-12-03 01:28:39.234577"], ["course_id", 3901], ["name", "team"]]
SELECT 1 AS one FROM "teams" INNER JOIN "students_teams" ON "teams"."id" = "students_teams"."team_id" WHERE "students_teams"."student_id" = ? AND "teams"."id" = ? LIMIT ?  [["student_id", 3], ["id", 1], ["LIMIT", 1]]

  def index
    @teams = Team.all
---
SELECT "teams".* FROM "teams"

  def create
    params.permit!
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("created_at", "updated_at", "course_id", "name") VALUES (?, ?, ?, ?)  [["created_at", "2022-12-05 23:26:40.255107"], ["updated_at", "2022-12-05 23:26:40.255107"], ["course_id", 1], ["name", "Project Team"]]

  def destroy
    @team.destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]

    def set_team
      @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]