app/controllers/tech_task_evaluations_controller.rb

  def index
    @tech_task_evaluations = TechTaskEvaluation.all
---
SELECT "tech_task_evaluations".* FROM "tech_task_evaluations"

  def create
    #Allowing all params for :teamid to work properly
    params.permit!
    @tech_task_evaluation = TechTaskEvaluation.new(tech_task_evaluation_params)

    respond_to do |format|
      if @tech_task_evaluation.save
---
INSERT INTO "tech_task_evaluations" ("overall", "research", "presentation", "best_qualities", "improve_on", "professor", "other", "created_at", "updated_at", "teamid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @tech_task_evaluation.destroy
---
DELETE FROM "tech_task_evaluations" WHERE "tech_task_evaluations"."id" = ?  [["id", 4]]

    def set_tech_task_evaluation
      @tech_task_evaluation = TechTaskEvaluation.find(params[:id])
---
SELECT "tech_task_evaluations".* FROM "tech_task_evaluations" WHERE "tech_task_evaluations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]