app/controllers/users/registrations_controller.rb

INSERT INTO "students" ("namedotnumber", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["namedotnumber", "imbrock.5"], ["first_name", "test"], ["last_name", "imbrock"], ["created_at", "2022-12-05 01:23:07.711077"], ["updated_at", "2022-12-05 01:23:07.711077"]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "role", "first_name", "last_name", "namedotnumber") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "admins" ("namedotnumber", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["namedotnumber", "admin.1"], ["first_name", "Admin"], ["last_name", "Admin"], ["created_at", "2022-12-05 18:25:50.834917"], ["updated_at", "2022-12-05 18:25:50.834917"]]
---
  def create
    if params[:user][:role] == "student"
        @student = Student.create({
          first_name: params[:user][:first_name],
          last_name: params[:user][:last_name],
          namedotnumber: params[:user][:namedotnumber]
        })
    else
        @admin = Admin.create({
          first_name: params[:user][:first_name],
          last_name: params[:user][:last_name],
          namedotnumber: params[:user][:namedotnumber]
        })